docs/time-course.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-02-12 Wed 11:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Fully unsupervised topic models of scRNA-seq time course data</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="htmlize.css"/>
<link rel="stylesheet" type="text/css" href="main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Fully unsupervised topic models of scRNA-seq time course data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb76e5c">Introduction</a></li>
<li><a href="#setup">Setup</a></li>
<li><a href="#org1860a88">Methods</a>
<ul>
<li><a href="#orgdd042e9">Amortized NMF/LDA</a></li>
<li><a href="#orga68114a">iPSC data</a></li>
</ul>
</li>
<li><a href="#org1cce9ff">Results</a>
<ul>
<li><a href="#org37c13a2">Unsupervised NMF on iPSCs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb76e5c" class="outline-2">
<h2 id="orgbb76e5c">Introduction</h2>
<div class="outline-text-2" id="text-orgbb76e5c">
<p>
In our prior work (<a href="https://dx.doi.org/10.1371/journal.pgen.1008045">Sarkar
et al. 2019</a>), we introduced a factor model to capture between donor
individual variation in the mean and variance of gene expression in a single
cell type \( 
  \DeclareMathOperator\Gam{Gamma}
  \DeclareMathOperator\Poi{Poisson}
  \newcommand\mf{\mathbf{F}} 
  \newcommand\ml{\mathbf{L}}
  \newcommand\mx{\mathbf{X}}
  \newcommand\vl{\mathbf{l}}
  \newcommand\vx{\mathbf{x}}
  \)
</p>

\begin{align*}
  x_{ij} &\sim \Poi(x_i^+ \lambda_{ij})\\
  \lambda_{ij} &\sim \pi_{ij} \delta_0(\cdot) + (1 - \pi_{ij}) \Gam(\phi_{ij}^{-1}, \mu_{ij}^{-1} \phi_{ij}^{-1})\\
  \ln \mu_{ij} &= (\ml \mf_\mu')_{ij}\\
  \ln \phi_{ij} &= (\ml \mf_\phi')_{ij}\\
  \operatorname{logit} \pi_{ij} &= (\ml \mf_\pi')_{ij}\\
\end{align*}

<p>
where 
</p>

<ul class="org-ul">
<li>\(x_{ij}\) is the number of molecules of gene \(j = 1, \ldots, p\) observed
in cell \(i = 1, \ldots, n\)</li>
<li>cells are taken from \(m\) donor individuals, \(\ml\) is \(n \times m\),
each \(\mf_{\cdot}\) is \(p \times m\)</li>
<li>assignments of cells to donors (loadings) \(l_{ik} \in \{0, 1\}\) are
known and fixed.</li>
</ul>

<p>
We are now interested in several lines of questions:
</p>

<ol class="org-ol">
<li>If we analyze this kind of data in a fully unsupervised manner, can we
recover the assignments of cells to donors? This approach has been
previously proposed in our specific factor model
(<a href="10.1038/s41467-017-02554-5">Risso et al. 2018</a>). If not, what do
we recover?</li>
<li>Can we generalize this analysis approach to data which additionally has
multiple cell types, and then multiple time points?</li>
<li>Can we implement this approach without forming entire products
\(\ml\mf'\)? Can we implement each update without looking at the entire
data \(\mx\)? How much faster can we get than existing methods? Can we
analyze datasets which are currently impossible to analyze (due to size),
e.g. Human Cell Atlas? As references, compare against
<a href="10.1038/s41592-018-0229-2">scVI</a>,
<a href="https://rawcdn.githack.com/aertslab/cisTopic/8d15fa2813312aa0b20c1042604079558829e947/vignettes/10X_workflow.html#building_the_models">cisTopic</a>,
<a href="https://github.com/stephenslab/fastTopics">fastTopics</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgaef0b05" class="outline-2">
<h2 id="setup"><a id="orgaef0b05"></a>Setup</h2>
<div class="outline-text-2" id="text-setup">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">import</span> anndata
<span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-keyword">import</span> scipy.sparse <span class="org-keyword">as</span> ss
<span class="org-keyword">import</span> sklearn.decomposition <span class="org-keyword">as</span> skd
<span class="org-keyword">import</span> torch
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">%matplotlib inline
%config <span class="org-variable-name">InlineBackend.figure_formats</span> = <span class="org-builtin">set</span>([<span class="org-string">'retina'</span>])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt
<span class="org-variable-name">plt.rcParams</span>[<span class="org-string">'figure.facecolor'</span>] = <span class="org-string">'w'</span>
<span class="org-variable-name">plt.rcParams</span>[<span class="org-string">'font.family'</span>] = <span class="org-string">'Nimbus Sans'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1860a88" class="outline-2">
<h2 id="org1860a88">Methods</h2>
<div class="outline-text-2" id="text-org1860a88">
</div>
<div id="outline-container-orgdd042e9" class="outline-3">
<h3 id="orgdd042e9">Amortized NMF/LDA</h3>
<div class="outline-text-3" id="text-orgdd042e9">
<p>
Amortized inference
(<a href="http://ruishu.io/2017/11/07/amortized-optimization/">Shu 2017</a>,
<a href="https://papers.nips.cc/paper/7692-amortized-inference-regularization.pdf">Shu
et al. 2018</a>) refers to a general solution to coupled optimization
problems:
</p>

<p>
\[ \theta^* = \arg\min_\theta f(\theta, \phi) \]
</p>

<p>
where \(\phi \in \Phi\) is some context variable. Rather than solving one
problem for each \(\phi\), we learn a function \(h_\alpha: \phi \rightarrow
   \theta^*\) parameterized by \(\alpha\)
</p>

<p>
\[ \alpha^* = \arg\min_\alpha E_{\phi \sim \hat{p}(\phi)} f(h_\alpha(\phi), \phi) \]
</p>

<p>
where \(\hat{p}(\phi)\) denotes the empirical distribution of \(\phi\) in
the training data. As a concrete example, NMF (Lee and Seung 2001q) can be
written
</p>

<p>
\[ \vl_i^* = \arg\min_{\vl_i} \sum_{j, k} \operatorname{Poisson}(x_{ij}; l_{ik} f_{jk})\]
</p>

<p>
where \(\vx_i\) is the context variable, and the goal is to learn
\(h_\alpha\) which maps observations \(\mathbf{x}_{i}\) to loadings
\(\mathbf{l}_{i}\). This can be achieved by introducing an <i>encoder
network</i>, which has been previously proposed
(<a href="10.1038/s41592-018-0229-2">Lopez et al. 2018</a>,
<a href="10.1038/s41467-018-07931-2">Eraslan et al. 2018</a>).
</p>

<p>
NMF is intimately connected to LDA via the Multinomial-Poisson transform
(<a href="http://www.jstor.org/stable/2348134">Baker 1994</a>). Briefly, if we have
an MLE for NMF and scale \(\ml\) and \(\mf\) to satisfy the constraints
\(\sum_k l_{ik} = 1\), \(\sum_k f_{jk} = 1\), we recover an MLE for the
Multinomial likelihood underlying LDA. This fact suggests an amortized
inference scheme for maximum likelihood estimation of topic models:
</p>

\begin{align*}
  x_{ij} \mid s_i, \mathbf{l}_i, \mathbf{F} &\sim \operatorname{Poisson}(s_i \sum_k l_{ik} f_{jk})\\
  \mathbf{l}_i &= h(\mathbf{x}_i)
\end{align*}

<p>
where \(h\) is a neural network with softmax output. Unlike previous
approaches for amortized inference in topic models
(<a href="https://arxiv.org/pdf/1703.01488">Srivastava et al. 2017</a>), we are not
concerned with recovering an approximate posterior over \(\mathbf{L},
   \mathbf{F}\), simplifying the problem. Our scheme suggests a fast GPU
implementation based on minibatch gradient descent.
</p>
</div>
</div>

<div id="outline-container-orga68114a" class="outline-3">
<h3 id="orga68114a">iPSC data</h3>
<div class="outline-text-3" id="text-orga68114a">
<p>
Read the data.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">keep_samples</span> = pd.read_table(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/quality-single-cells.txt'</span>, index_col=0, header=<span class="org-constant">None</span>)
<span class="org-variable-name">keep_genes</span> = pd.read_table(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/genes-pass-filter.txt'</span>, index_col=0, header=<span class="org-constant">None</span>)
<span class="org-variable-name">annotations</span> = pd.read_table(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/scqtl-annotation.txt'</span>)
<span class="org-variable-name">annotations</span> = annotations.loc[keep_samples.values.ravel()]
<span class="org-variable-name">header</span> = <span class="org-builtin">sorted</span>(<span class="org-builtin">set</span>(annotations[<span class="org-string">'chip_id'</span>]))
<span class="org-variable-name">umi</span> = pd.read_table(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/scqtl-counts.txt.gz'</span>, index_col=0).loc[keep_genes.values.ravel(),keep_samples.values.ravel()]
<span class="org-variable-name">gene_info</span> = pd.read_table(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/scqtl-genes.txt.gz'</span>, index_col=0)
</pre>
</div>

<p>
Convert to sparse <code>h5ad</code>.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">del</span> annotations[<span class="org-string">"index"</span>]
<span class="org-variable-name">x</span> = anndata.AnnData(ss.csr_matrix(umi.values.T), obs=annotations, var=gene_info.loc[umi.index])
x.write(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/ipsc/ipsc.h5ad'</span>, compression=<span class="org-constant">None</span>, force_dense=<span class="org-constant">False</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1cce9ff" class="outline-2">
<h2 id="org1cce9ff">Results</h2>
<div class="outline-text-2" id="text-org1cce9ff">
</div>
<div id="outline-container-org37c13a2" class="outline-3">
<h3 id="org37c13a2">Unsupervised NMF on iPSCs</h3>
<div class="outline-text-3" id="text-org37c13a2">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">x</span> = anndata.read_h5ad(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/ipsc/ipsc.h5ad'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">m</span> = skd.NMF(n_components=53, beta_loss=1, solver=<span class="org-string">'mu'</span>, verbose=<span class="org-constant">True</span>).fit(x.X)
<span class="org-variable-name">f</span> = m.components_.T
<span class="org-variable-name">l</span> = m.transform(x.X)
</pre>
</div>

<p>
0 - f38355c7-4293-4104-babc-10a2759ce749
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2020-02-12 Wed 11:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
